src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/C2D_Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Клиенты</name>
  <resources>
    <name>Клиент</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>avatar</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>assigned_name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>client_phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяТипаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Клиенты/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Оповестить("C2D_ОбновитьСписокЧатов");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Клиент.ОграничениеТипа = РегистрыСведений.C2D_ТипыКлиентов.ПолучитьТипыДанных();
	Клиент = РегистрыСведений.C2D_Клиенты.НайтиСсылкуПоID(Запись.ID);
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	Запись.Клиент = Клиент.уникальныйИдентификатор();
	Запись.ПолноеИмяТипаДанных = клиент.метаданные().ПолноеИмя();
	Запись.Представление = РегистрыСведений.C2D_Клиенты.СформироватьПредставление(запись);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	КлиентПриИзмененииНаСервере();
КонецПроцедуры
